import math


def area(r: float) -> float:
    '''
    Принимает число r, возвращает площадь окружности с радиусом r

    Параметры:
        r (float) : задаваемый радиус

    Возвращаемое значение:
        area (float) : число Пи умноженное на квадрат радиуса

    Пример вызова:
        area(1) -> 3,1415...
    '''
    return math.pi * r * r


def perimeter(r: float) -> float:
    '''
    Принимает число r, возвращает периметр окружности с радиусом r

    Параметры:
        r (float) : задаваемый радиус

    Возвращаемое значение:
        area (float) : число Пи умноженное на удвоенный радиус

    Пример вызова:
        area(0.5) -> 3,1415...
    '''
    return 2 * math.pi * r

