def area(a: float, b: float) -> float:
    '''
    Принимает числа a, b, возвращает площадь прямоугольника со сторонами a, b

    Параметры:
        a (float) : задаваемая длина
        b (float) : задаваемая ширина

    Возвращаемое значение:
        area (float) : длина умноженная на ширину

    Пример вызова:
        area(1, 1) -> 1.0
    '''
    return a * b

def perimeter(a: float, b: float) -> float:
    '''
    Принимает числа a, b, возвращает периметр прямоугольника со сторонами a, b

    Параметры:
        a (float) : задаваемая длина
        b (float) : задаваемая ширина

    Возвращаемое значение:
        perimetr (float) : удвоенная сумма длины и ширины

    Пример вызова:
        perimetr(1, 1) -> 4.0
    '''
    return 2 * (a + b)
