
def area(a: float) -> float:
    '''
    Принимает число a, возвращает Площадь квадрата со стороной а

    Параметры:
        a (float) : задаваемая сторона квадрата

    Возвращаемое значение:
        area (float) : квадрат числа a

    Пример вызова:
        area(1) -> 1
    '''
    return a * a


def perimeter(a: float) -> float:
    '''
    Принимает число a, возвращает периметр квадрата со стороной а

    Параметры:
        a (float) : задаваемая сторона квадрата

    Возвращаемое значение:
        perimetr (float) : сторона квадрата умноженная на 4

    Пример вызова:
        perimetr(1) -> 4
    '''
    return 4 * a
