def area(a: float, h: float) -> float:
    '''
        Принимает числа a, h, возвращает площадь треугольника со стороной а и высотой к этой стороне h

        Параметры:
            a (float) : задаваемая сторона
            h (float) : задаваемая высота

        Возвращаемое значение:
            area (float) : половина стороны умноженной на высоту

        Пример вызова:
            area(1, 1) -> 0.5
    '''
    return a * h / 2

def perimeter(a: float, b: float, c: float) -> float:
    '''
    Принимает числа a, b, c, возвращает периметр треугольника со сторонами a, b, c

    Параметры:
        a (float) : задаваемая сторона
        b (float) : задаваемая сторона
        c (float) : задаваемая сторона

    Возвращаемое значение:
        perimetr (float) : сумма длин всех сторон

    Пример вызова:
        perimetr(1, 1, 1) -> 3.0
    '''
    return a + b + c